Revit 2027 API
PointCloudColorSettings(PointCloudColorSettings) Constructor
 Constructs a copy of source object.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudColorSettings(
	PointCloudColorSettings other
)
Public Sub New (
	other As PointCloudColorSettings
)
public:
PointCloudColorSettings(
	PointCloudColorSettings^ other
)
new :
        other : PointCloudColorSettings -> PointCloudColorSettings
Parameters
other PointCloudColorSettings
 Source object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudColorSettings Class
PointCloudColorSettings Overload
Autodesk.Revit.DB.PointClouds Namespace